clc
clear all
%нахождение критического сечения сопла
R=3
Fkr=pi*R^2
x1=6*tand(10);
F1=pi*(R+x1)^2;
q1=Fkr/F1;
x2=3*tand(10);
F2=pi*(R+x2)^2;
q2=Fkr/F2;
x4=3*0.0611
F4=pi*(R+x4)^2;
q4=Fkr/F4
x5=9*0.0611;
F5=pi*(R+x5)^2;
q5=Fkr/F5;
x6=21*0.0611;
F6=pi*(R+x6)^2;
q6=Fkr/F6
x7=33*0.0611;
F7=pi*(R+x7)^2;
q7=Fkr/F7
x8=42*0.0611;
F8=pi*(R+x8)^2;
q8=Fkr/F8;
x9=49*0.0611;
F9=pi*(R+x9)^2;
q9=Fkr/F9;
Fexit=pi*6^2
qexit=Fkr/Fexit

clc
clear all
M=[0.339;0.478;1;1.42;1.76;2.22;2.56;2.78;2.937;2.94];
y=1.14;
%определеяем отношения в выделенных сечениях
a=(1+((y-1)/2).*(M.^2)).^(-0.5);
T=(1+((y-1)/2).*(M.^2)).^(-1);
po=(1+((y-1)/2).*(M.^2)).^(-1/(y-1));
p=(1+((y-1)/2).*(M.^2)).^(-y/(y-1));
v=(((y-1)/2).*(M.^2)/(1+((y-1)/2)*(M.^2)))^(0.5);

clc
clear all
x=[-6;-3;0;3;9;21;33;42;49;50];
M=[0.339;0.478;1;1.42;1.76;2.22;2.56;2.78;2.937;2.94];
a=[0.9888;0.9779;0.9129;0.8442;0.7858;0.7097;0.6578;0.6268;0.6058;0.6054];
T=[0.9775;0.9563;0.8333;0.7126;0.6175;0.5036;0.4328;0.3928;0.3669;0.366];
ro=[0.9448;0.8943;0.6339;0.4287;0.2996;0.1800;0.1232;0.0967;0.0816;0.0813];
%p=[0.9235;0.8552;0.5283;0.3055;0.1850;0.0906;0.0533;0.0380;0.0299;0.0298];
v=[0.1503;0.2089;0.4083;0.5361;0.6125;0.7046;0.7532;0.7803;0.7950;0.7959];
h=-6:0.001:51;
gra=pchip(x,a,h);
figure(1)
plot(x,a,'x',h,gra);
axis([-6,51,0,1]);
hold on
grid on
grt=pchip(x,T,h);
plot(x,T,'x',h,grt);
grro=pchip(x,ro,h);
plot(x,ro,'x',h,grro,'-.');
%grp=pchip(x,p,h);
%plot(x,p,'x',h,grp);
grv=pchip(x,v,h);
plot(x,v,'x',h,grv,'--');
xlabel('Сечение,мм');
ylabel('Изменение параметра');
legend('','a/a0','','T/T0','','ro/ro0','','p/p0','','v/vmax');
hold off
figure(2)
grM=pchip(x,M,h);
plot(x,M,'x',h,grM);
grid on
axis([-8,51,0.3,3]);
xlabel('Сечение,мм');
ylabel('Число М');

clc
clear all
p=[29.5;27;16;13.5;7.0;3.7;1.85;1.3;1];
p0=33
P=p/p0
x=[-6;-3;0;3;9;21;33;42;50];
pteor=[0.9235;0.8552;0.5283;0.3055;0.1850;0.0906;0.0533;0.0380;0.0298];
h=-6:0.001:51;
grP=pchip(x,P,h);
grpteor=pchip(x,pteor,h);
figure(3)
plot(x,P,'x',h,grP)
grid on
hold on
plot(x,pteor,'x',h,grpteor,'--');
xlabel('Сечение,мм');
ylabel('Значение давления');
legend('','Экспериментальное','','Теоретическое')


clc
clear all
y=1.4;
R=287.1;
T0=288;
f=0.0404;
p0=33*101325
Rad=3;
Fkr=pi*Rad^2/10^6;
%расчёт расхода газа
Q=(f*p0*Fkr)/sqrt(T0);
%расчёт величины реактивной силы
Votn=0.7959;
Vmax=sqrt((2*y*R*T0)/(y-1))
Va=Votn*Vmax;
pn=101325;
pa=(1/33)*p0;
Fa=113.0973*10^-6;
P=Q*Va+(pa-pn)*Fa;

Pud=Va+((pa-pn)*Fa)/Q


y1=1.47;
M22=2.93
p22=(1+((y1-1)/2)*(M22^2))^(-y1/(y1-1));

